import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let vn = './media/menu.mp3'
let pp = imagen4
let img = await(await fetch('https://telegra.ph/file/5aa73a371ea32c99d3b4e.jpg')).buffer()
let d = new Date(new Date + 3600000)
let locale = 'ar'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
let { money, joincount } = global.db.data.users[m.sender]
let { exp, limit, level, role } = global.db.data.users[m.sender]
let { min, xp, max } = xpRange(level, global.multiplier)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `
*⋄━──═◟𝘿𝙖𝙗𝙞 𝘽𝙤𝙩💠◟═──━⋄*
*عم البوتات معاك 🔷👑* 
*⋄━──═◞تعريف البوت📑◟═──━⋄*
*اسم البوت🏷️* :*𝘿𝙖𝙗𝙞 𝘽𝙤𝙩*

*المطور👑*  :https://wa.me/+201110156619@s.whatsapp.net/

*مده العمل* :${uptime} 

*لازم تقرأ الملحوظات الي في اخر القائمة 📌*

*⋄━──═◞🗃️الجروبات🗃️◟═──━⋄*

.*المشرفين←*☢︎︎☠︎︎ 📔🔷
.*الجروب←*☢︎︎☠︎︎ 📔🔷
.*مخفي←*☢︎︎☠︎︎ 📔🔷
.*منشن←*☢︎︎☠︎︎ 📔🔷
.*الاشباح←*☢︎︎☠︎︎ 📔🔷
.*لينك←*☢︎︎☠︎︎ 📔🔷
*رفع←*☢︎︎☠︎︎ 📔🔷
.*خفض←*☢︎︎☠︎︎ 📔🔷
.*رستر←*☢︎︎☠︎︎ 📔🔷
.*ضيف←*☢︎︎☠︎︎ 📔🔷
.*طرد←*☢︎︎☠︎︎ 📔🔷
.*اعفااء←*☢︎︎☠︎︎ 📔🔷
.*دعوه←*☢︎︎☠︎︎ 📔🔷
.*تغيرالاسم←*☢︎︎☠︎︎ 📔🔷
.*تغيرالوصف←*☢︎︎☠︎︎ 📔🔷
.*تغيرالصوره←*☢︎︎☠︎︎ 📔🔷
.*جروب فتح←*☢︎︎☠︎︎ 📔🔷
.*جروب غلق←*☢︎︎☠︎︎ 📔🔷
.*البنك←*☢︎︎☠︎︎ 📔🔷
.*شراء←*☢︎︎☠︎︎ 📔🔷
.*يومي←*☢︎︎☠︎︎ 📔🔷
.*لفل←*☢︎︎☠︎︎ 📔🔷
.*تحويل←*☢︎︎☠︎︎ 📔🔷
.*تصنيف←*☢︎︎☠︎︎ 📔🔷
.*هجوم←*☢︎︎☠︎︎ 📔🔷
.*اضف-جواهر←*☢︎︎☠︎︎ 📔🔷
.*اضف-اكسبي←*☢︎︎☠︎︎ 📔🔷
.*تعدين←*☢︎︎☠︎︎ 📔🔷

*⋄━──═◞🎮ترفيه🎮◟═──━⋄*

.*لو←*☢︎︎☠︎︎👾🔷
.*توب←*☢︎︎☠︎︎👾🔷
.*بوت (قبليها نقطه)←*☢︎︎☠︎︎👾🔷
.*صوت-انمي1←*☢︎︎☠︎︎👾🔷
.*تحدث←*☢︎︎☠︎︎👾🔷
.*سؤال←*☢︎︎☠︎︎👾🔷
.*زخرفه←*☢︎︎☠︎︎👾🔷
.*لوجو←*☢︎︎☠︎︎👾🔷
.*انصح←*☢︎︎☠︎︎👾🔷
.*زواج←*☢︎︎☠︎︎👾🔷
.*طلاق←*☢︎︎☠︎︎👾🔷
.*ذكاء←*☢︎︎☠︎︎👾🔷
.*غباء←*☢︎︎☠︎︎👾🔷
.*جمال←*☢︎︎☠︎︎👾🔷
.*هل←*☢︎︎☠︎︎👾🔷
.*خط←*☢︎︎☠︎︎👾🔷
.*احزر←*☢︎︎☠︎︎👾🔷
.*تاج←*☢︎︎☠︎︎👾🔷
.*عين←*☢︎︎☠︎︎👾🔷
.*علم←*☢︎︎☠︎︎👾🔷
.*سيارات←*☢︎︎☠︎︎👾🔷
.*رفيق←*☢︎︎☠︎︎👾🔷
.*رياضه←*☢︎︎☠︎︎👾🔷
.*فكك←*☢︎︎☠︎︎👾🔷
.*حروف←*☢︎︎☠︎︎👾🔷
.*رهان←*☢︎︎☠︎︎👾🔷
.*جنيه←*☢︎︎☠︎︎👾🔷
.*دحيح←*☢︎︎☠︎︎👾🔷
.*اصطناعي←*☢︎︎☠︎︎👾🔷
.*رونالدو←*☢︎︎☠︎︎👾🔷
.*ميسي←*☢︎︎☠︎︎👾🔷
.*قدوتي←*☢︎︎☠︎︎👾🔷
.*جريمة←*☢︎︎☠︎︎👾🔷
.*نرد←*☢︎︎☠︎︎👾🔷
.*احضن←*☢︎︎☠︎︎👾🔷
.*اصفع←*☢︎︎☠︎︎👾🔷
.*مناخ←*☢︎︎☠︎︎👾🔷
.*بروفايل←*☢︎︎☠︎︎👾🔷
.*المطورج←*☢︎︎☠︎︎👾🔷
.*الدعم←*☢︎︎☠︎︎👾🔷
.*انطق←*☢︎︎☠︎︎👾🔷
.*الخصوصية←*☢︎︎☠︎︎👾🔷
.*اقتباس←*☢︎︎☠︎︎👾🔷
.*حي←*☢︎︎☠︎︎👾🔷
.*إبلاغ←*☢︎︎☠︎︎👾🔷
.*الرقم-التسلسلي←*☢︎︎☠︎︎👾🔷
.*تفعيل←*☢︎︎☠︎︎👾🔷
.*تسجيل-خروج←*☢︎︎☠︎︎👾🔷
.*بنق←*☢︎︎☠︎︎👾🔷
.*نشاط←*☢︎︎☠︎︎👾🔷

*⋄━──═◞🔊صوتيات🔊◟═──━⋄*

.*عميق←*☢︎︎☠︎︎📢🔷
.*عميق2←*☢︎︎☠︎︎📢🔷
.*منفوخ←*☢︎︎☠︎︎📢🔷
.*تحسين←*☢︎︎☠︎︎📢🔷
.*سريع←*☢︎︎☠︎︎📢🔷
.*تسريع-بسيط←*☢︎︎☠︎︎📢🔷
.*عكس←*☢︎︎☠︎︎📢🔷
.*آلي←*☢︎︎☠︎︎📢🔷
.*بطئ←*☢︎︎☠︎︎📢🔷
.*سلس←*☢︎︎☠︎︎📢🔷
.*سنجاب←*☢︎︎☠︎︎📢🔷

*⋄━──═◞🔄تحويلات🔄◟═──━⋄*

.*كود←*☢︎︎☠︎︎🔁🔷
.*ملصق←*☢︎︎☠︎︎🔁🔷
.*سرقه←*☢︎︎☠︎︎🔁🔷
.*دمج←*☢︎︎☠︎︎🔁🔷
.*لصوره←*☢︎︎☠︎︎🔁🔷
.*لانمي←*☢︎︎☠︎︎🔁🔷
.*لكرتون←*☢︎︎☠︎︎🔁🔷
.*لفيديو←*☢︎︎☠︎︎🔁🔷
.*تليجراف←*☢︎︎☠︎︎🔁🔷
.*جوده←*☢︎︎☠︎︎🔁🔷
.*غيف←*☢︎︎☠︎︎🔁🔷
.*طمس←*☢︎︎☠︎︎🔁🔷

*⋄━──═◞⬇️تنزيلات⬇️◟═──━⋄*

.*بحث←*☢︎︎☠︎︎📩🔷
.*شغل←*☢︎︎☠︎︎📩🔷
.*فيديو←*☢︎︎☠︎︎📩🔷
.*انستا←*☢︎︎☠︎︎📩🔷
.*تيك←*☢︎︎☠︎︎📩🔷
.*بلاي←*☢︎︎☠︎︎📩🔷
.*صوره←*☢︎︎☠︎︎📩🔷
.*فريبيك←*☢︎︎☠︎︎📩🔷
.*بينترست←*☢︎︎☠︎︎📩🔷
.*خلفيه←*☢︎︎☠︎︎📩🔷
.*ميمز←*☢︎︎☠︎︎📩🔷
.*طقم←*☢︎︎☠︎︎📩🔷
.*طقم2←*☢︎︎☠︎︎📩🔷
.*كلب←*☢︎︎☠︎︎📩🔷
.*قط←*☢︎︎☠︎︎📩🔷
.*ايدت←*☢︎︎☠︎︎📩🔷
.*تصميم←*☢︎︎☠︎︎📩🔷
.*جوده←*☢︎︎☠︎︎📩🔷
.*ايزن←*☢︎︎☠︎︎📩🔷

*⋄━──═◞🕋قسم ديني🕋◟═──━⋄*

.*صوت 1←* ☢︎︎☠︎︎❣️🔷
.*أذكار الصباح←* ☢︎︎☠︎︎❣️🔷
.*أذكار المساء←* ☢︎︎☠︎︎❣️🔷

*⋄━──═◞👑قسم المطور👑◟═──━⋄*

.*بريم←*☢︎︎☠︎︎✨🔷
.*حظر←*☢︎︎☠︎︎✨🔷
. إلغاء-الحظر*←*☢︎︎☠︎︎✨🔷
.*بان←*☢︎︎☠︎︎✨🔷
.*رفع-البان←*☢︎︎☠︎︎✨🔷
.*بلوك←*☢︎︎☠︎︎✨🔷
.*رفع-البلوك←*☢︎︎☠︎︎✨🔷
.*المميزين←*☢︎︎☠︎︎✨🔷
.*المحظورين←*☢︎︎☠︎︎✨🔷
.*البلوكات←*☢︎︎☠︎︎✨🔷
.*انضم←*☢︎︎☠︎︎✨🔷
.*اخرج←*☢︎︎☠︎︎✨🔷
.نشر*←*☢︎︎☠︎︎✨🔷
.*ارفعني←*☢︎︎☠︎︎✨🔷
.*ريستارت←*☢︎︎☠︎︎✨🔷
.*وضع-صوره←*☢︎︎☠︎︎✨🔷

*⋄━──═◟ملحوظة هامة⁉️◟═──━⋄*

*مينفعش تكلم البوت خاص🙅👎*
*لو كلمت البوت خاص سيتم حظرك❌*

*لو عندك امر عايز تضيفه كلم المطور🌠👑*
*ولو أمر ما اشتغلش كلم المطور هيصلحه في تعديلات 🔧*


*ومع تحيات المطور تجربه رائعه للبوت*✨
~`.trim()
let buttonMessage = {
image: pp,
caption: str.trim(),
mentions: [m.sender],
footer: `${wm}`,
headerType: 4,
contextInfo: {
mentionedJid: [m.sender],
externalAdReply: {
showAdAttribution: true,
mediaType: 'VIDEO',
mediaUrl: null,
title: '『👑┇𝔘𝔩𝔮𝔲𝔦𝔬𝔯𝔯𝔞┇🤖┇𝔅𝔬𝔱┇👑』',
body: null,
thumbnail: img,
sourceUrl: `https://telegra.ph/file/5aa73a371ea32c99d3b4e.jpg`

}}}
conn.sendMessage(m.chat, buttonMessage, { quoted: m })
//await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
} catch {
conn.reply(m.chat, '[❗𝐈𝐍𝐅𝐎❗] 𝙴𝙻 𝙼𝙴𝙽𝚄 𝚃𝙸𝙴𝙽𝙴 𝚄𝙽 𝙴𝚁𝚁𝙾𝚁 𝚈 𝙽𝙾 𝙵𝚄𝙴 𝙿𝙾𝚂𝙸𝙱𝙻𝙴 𝙴𝙽𝚅𝙸𝙰𝚁𝙻𝙾, 𝚁𝙴𝙿𝙾𝚁𝚃𝙴𝙻𝙾 𝙰𝙻 𝙿𝚁𝙾𝙿𝙸𝙴𝚃𝙰𝚁𝙸𝙾 𝙳𝙴𝙻 𝙱𝙾𝚃', m)
}}
handler.command = /^(اوامر|الاوامر|الأوامر|أوامر)$/i
handler.exp = 50
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
